# Date Night Movie

#### Grading:


- Code: 90 pts
- Markdown Documentation: 10 pts

In this assignment we are going to use pandas to figure out - What's the best **date-night movie**?

This assignment is going to use
- Joining
- Groupby
- Sorting

In [1]:
import os
import pandas as pd

##### Read in the movie data: `pd.read_table`

In [2]:
def get_movie_data():
    
    unames = ['user_id','gender','age','occupation','zip']
    users = pd.read_table(os.path.join('../data','users.dat'), 
                          sep='::', header=None, names=unames)
    
    rnames = ['user_id', 'movie_id', 'rating', 'timestamp']
    ratings = pd.read_table(os.path.join('../data', 'ratings.dat'), 
                            sep='::', header=None, names=rnames)
    
    mnames = ['movie_id', 'title','genres']
    movies = pd.read_table(os.path.join('../data', 'movies.dat'), 
                           sep='::', header=None, names=mnames)

    return users, ratings, movies

In [3]:
users, ratings, movies = get_movie_data()

C:\Users\macia\Anaconda3\lib\site-packages\ipykernel_launcher.py:5: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """
C:\Users\macia\Anaconda3\lib\site-packages\ipykernel_launcher.py:9: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  if __name__ == '__main__':
C:\Users\macia\Anaconda3\lib\site-packages\ipykernel_launcher.py:13: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  del sys.path[0]

In [4]:
users.head()

   user_id gender  age  occupation    zip
0        1      F    1          10  48067
1        2      M   56          16  70072
2        3      M   25          15  55117
3        4      M   45           7  02460
4        5      M   25          20  55455

In [5]:
ratings.head()

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [6]:
movies.head()

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

##### Clean up the `movies`

- Get the `year`
- Shorten the `title`

In [7]:
tmp = movies.title.str.extract('(.*) \(([0-9]+)\)')
tmp.apply(lambda x:x[0] if len(x) > 0 else None)
tmp.apply(lambda x: x[0][:40] if len(x) > 0 else None)

0    Toy Story
1         1995
dtype: object

In [8]:
movies['year'] = tmp[1]
movies['short_title'] = tmp[0]

In [9]:
movies.head()

,movie_id,title,genres,year,short_title
0,1,Toy Story (1995),Animation|Children's|Comedy,1995,Toy Story
1,2,Jumanji (1995),Adventure|Children's|Fantasy,1995,Jumanji
2,3,Grumpier Old Men (1995),Comedy|Romance,1995,Grumpier Old Men
3,4,Waiting to Exhale (1995),Comedy|Drama,1995,Waiting to Exhale
4,5,Father of the Bride Part II (1995),Comedy,1995,Father of the Bride Part II

##### Join the tables with `pd.merge` (20 pts)

In [10]:
print(users.shape)
print(ratings.shape)
print(movies.shape)
u_r = pd.merge(users,ratings)
u_r_m = pd.merge(u_r,movies)

u_r_m.head()

(6040, 5)
(1000209, 4)
(3883, 5)

,user_id,gender,age,occupation,zip,movie_id,rating,timestamp,title,genres,year,short_title
0,1,F,1,10,48067,1193,5,978300760,One Flew Over the Cuckoo's Nest (1975),Drama,1975,One Flew Over the Cuckoo's Nest
1,2,M,56,16,70072,1193,5,978298413,One Flew Over the Cuckoo's Nest (1975),Drama,1975,One Flew Over the Cuckoo's Nest
2,12,M,25,12,32793,1193,4,978220179,One Flew Over the Cuckoo's Nest (1975),Drama,1975,One Flew Over the Cuckoo's Nest
3,15,M,25,7,22903,1193,4,978199279,One Flew Over the Cuckoo's Nest (1975),Drama,1975,One Flew Over the Cuckoo's Nest
4,17,M,50,1,95350,1193,5,978158471,One Flew Over the Cuckoo's Nest (1975),Drama,1975,One Flew Over the Cuckoo's Nest

In [11]:
print(u_r_m.shape)

(1000209, 12)

##### What's the highest rated movie? (20 pts))

I've expanded to, What is the higest rated movie according most raters.

Since I've indexed by title and movie_id, I've taken the count of user_id to see how many ratings the movie had. Therefore, in the output below, user_id really means ratings_count

In [12]:
rating_counts=pd.pivot_table(u_r_m,
               index=['title','movie_id'],
               values=['rating','user_id'], 
               aggfunc={'rating':'mean',
                        'user_id':'size'}).sort_values(by=['rating','user_id'],
                                                       ascending=False)
print('These are the top 5 most and highest rated movies: user_id column is a count of all user_id that reviewed the movie')
rating_counts[rating_counts['user_id']>1000].head()

These are the top 5 most and highest rated movies: user_id column is a count of all user_id that reviewed the movie

                                             rating  user_id
title                            movie_id
Shawshank Redemption, The (1994) 318       4.554558     2227
Godfather, The (1972)            858       4.524966     2223
Usual Suspects, The (1995)       50        4.517106     1783
Schindler's List (1993)          527       4.510417     2304
Raiders of the Lost Ark (1981)   1198      4.477725     2514

###### What is a good rated movie for date night? (60 pts)

- Hint - highly rated movie by 
    - both partners (might be the same gender or not),
    - based on genre preferences,
    - age group can also be combined

In [13]:
Date_nite = pd.pivot_table(u_r_m,
               index=['title','movie_id','genres'],
               values=['rating','user_id'], 
               aggfunc={'rating':'mean',
                        'user_id':'size'}).sort_values(by=['rating','user_id'],
                                                       ascending=False)
Date_nite=Date_nite.reset_index()
Date_nite=Date_nite.groupby(['genres']).apply(lambda x: x.sort_values(['user_id'], ascending = False)).reset_index(drop=True)
genres=Date_nite['genres'].str.split('|')
unique_list = []
unique_genres = []
for x in genres:
    if x not in unique_list:
        unique_list.append(x)
        possible_genres=[j for i in unique_list for j in i]
        for x in possible_genres:
            if x not in unique_genres:
                unique_genres.append(x)

## Finding a good date night movie

This function will provide 5 top-rated movies according to genre provided as the argument. 

This code will find movies that contain the genre and return the top 2 rated movies within that specific genre combination. Example 'Action|Crime|Drama'. Then, will filter to well known movies using `rating count` and sort by `rating`. Finally, returning the top 5 rated movies similar to genre in question.  

I argue that instead of having an algorithm pick one sole movie to view, that instead the program display the top 5 movies by reviews and view so that I am able to make the decision.

In [14]:
def Get_Movies(Genre):
    try:
        if Genre in Date_nite['genres'].unique():
            Movie = Date_nite[Date_nite['genres'].str.contains(Genre)]
            Movie = Movie.groupby('genres').head(2)
            Movie = Movie[Movie['user_id']>1000].sort_values('rating',ascending = False).head(5)
            Movie=Movie.rename(columns = {'user_id':'rating count'})
        return Movie
    except:
        print('Genre not in movie selection. Please pick from the following genres:',*unique_genres,sep = '\n')

In [15]:
Get_Movies('arostie')

Genre not in movie selection. Please pick from the following genres:
Action
Adventure
Animation
Children's
Fantasy
Horror
Sci-Fi
Comedy
Crime
Romance
War
Drama
Thriller
Mystery
Western
Musical
Film-Noir
Documentary

In [16]:
Get_Movies('Horror')

,title,movie_id,genres,rating,rating count
1561,Young Frankenstein (1974),1278,Comedy|Horror,4.250629,1193
3381,Psycho (1960),1219,Horror|Thriller,4.218527,1263
361,Alien (1979),1214,Action|Horror|Sci-Fi|Thriller,4.159585,2024
3155,"Shining, The (1980)",1258,Horror,4.104876,1087
349,Jaws (1975),1387,Action|Horror,4.089570,1697